**step-1: Import packages**

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [1]:
a=10
b=20
c=a+b
print(c)

30

**step-2: Create a dataframe using list**

In [4]:
names=['Ramesh', 'Suresh', 'Sathish']
#pd.DataFrame(data,index,column)
pd.DataFrame(names)

         0
0   Ramesh
1   Suresh
2  Sathish

**step-3: I want to change the index**

In [5]:
names=['Ramesh', 'Suresh', 'Sathish']
ids=['A','B','C']
pd.DataFrame(names,ids)

         0
A   Ramesh
B   Suresh
C  Sathish

**step-4: Add the columns**

In [6]:
names=['Ramesh', 'Suresh', 'Sathish']
ids=['A','B','C']
cols=['Names']
pd.DataFrame(names,ids,cols)

     Names
A   Ramesh
B   Suresh
C  Sathish

**step-5: Data and columns**

In [5]:
names=['Ramesh', 'Suresh', 'Sathish']
cols=['Names']
pd.DataFrame(names,columns=cols)

     Names
0   Ramesh
1   Suresh
2  Sathish

**step-6: multiple columns**

In [4]:
names=['Ramesh', 'Suresh', 'Sathish']
age=[20,22,24]
cols=['Names', 'Age']
df=pd.DataFrame(zip(names,age),
                columns=cols)
df

     Names  Age
0   Ramesh   20
1   Suresh   22
2  Sathish   24

**step-7: add a new column to already existed dataframe**
- in above first we have taken data

- then created a dataframe

- now we want to add new data based on requirement

In [8]:
city=['Hyd','Pune','Blr']
df['City']=city
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

In [9]:
df['Marks']=[20,30,40]
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd     20
1   Suresh   22  Pune     30
2  Sathish   24   Blr     40

**step-8: Update the columns with new values**

In [10]:
df['Marks']=[200,300,400]
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd    200
1   Suresh   22  Pune    300
2  Sathish   24   Blr    400

**step-9: create empty dataframe and add the columns**

In [11]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Satish']
df['Age']=[20,22,24]
df['City']=['Hyd','Pune','Blr']
df

    Names  Age  City
0  Ramesh   20   Hyd
1  Suresh   22  Pune
2  Satish   24   Blr

**step-10: create a dataframe using dictionary**

In [12]:
d={'Naems':['Ramesh','Suresh','Satish'],
  'Age':[20,22,24],
  'City':['Hyd','Pune','Blr']}
df=pd.DataFrame(d)
df

    Naems  Age  City
0  Ramesh   20   Hyd
1  Suresh   22  Pune
2  Satish   24   Blr

In [16]:
d={'Name':'Ramesh',
  'Age':20}
pd.DataFrame(d)

ValueError: If using all scalar values, you must pass an index

In [17]:
d={'Name':'Raemsh',
   'Age':20}
pd.DataFrame(d,index=[0])

     Name  Age
0  Raemsh   20

**Step-11: Save the dataframe**

In [ ]:
#directory//filename.txt
#filename.txt
#we are saving dataframes
# .csv  or .xlml

In [8]:
df.to_csv('data.csv')

In [ ]:
df.to_csv(r'C:\Users\sneha\Documents\Naresh IT\EDA\data.csv')

In [10]:
df.to_excel('data.xlsx')

**step-12: Read the dataframe**

In [18]:
# in order to read the data
# filename.ext
#open(mbox_short.txt).read()
#open(dummy.txt,mode='w').write('hello')
#data.csv
pd.read_csv('data.csv')

   Unnamed: 0   Naems  Age  City
0           0  Ramesh   20   Hyd
1           1  Suresh   22  Pune
2           2  Satish   24   Blr

In [19]:
pd.read_excel('data.xlsx')

   Unnamed: 0   Naems  Age  City
0           0  Ramesh   20   Hyd
1           1  Suresh   22  Pune
2           2  Satish   24   Blr

In [20]:
d={'Names':['Ramesh','Suresh','Sathish'],
   'Age':[20,22,24],
   'City':['Hyd','Pune','Blr']}
df=pd.DataFrame(d)
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

In [16]:
df.to_csv('data1.csv',index=False)

In [17]:
pd.read_csv('data1.csv')

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

In [20]:
df.to_excel('data1.xlsx',index=False)

In [21]:
pd.read_excel('data1.xlsx')

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

In [ ]:
#add one more column marks to df

In [22]:
df['Marks']=[100,200,300]
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd    100
1   Suresh   22  Pune    200
2  Sathish   24   Blr    300

In [23]:
df.to_csv('data2.csv',index=False)

In [27]:
pd.read_csv('data2.csv')

     Names  Age  City  Marks
0   Ramesh   20   Hyd     34
1   Suresh   22  Pune     56
2  Sathish   24   Blr     54

**step-13: Drop the column**
- labels
 
- axis

- index

- columns
 
- inplace

In [24]:
#if i want to drop a index
# i need to use index argument name
df.drop(index=1)

     Names  Age City  Marks
0   Ramesh   20  Hyd    100
2  Sathish   24  Blr    300

In [25]:
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd    100
1   Suresh   22  Pune    200
2  Sathish   24   Blr    300

In [26]:
df.drop(columns='Marks')

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

In [27]:
df.drop(columns=['City','Marks'])

     Names  Age
0   Ramesh   20
1   Suresh   22
2  Sathish   24

In [ ]:
df.drop(index=1)
df.drop(columns='Marks')
##################
df.drop('marks') # if i dont give argument lable
df.drop(1) #a become label
##########################
#we need to axis
# axis=0 indicates index
#axis=1 indicates the columns

In [ ]:
df.drop('Marks')
#by default label='Marks'
# if you dont mention axis
# by default axis=0=====?

In [29]:
df.drop(index=1)
df.drop(columns='Marks')

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

In [28]:
df.drop('Marks',axis=0)

KeyError: "['Marks'] not found in axis"

In [31]:
df.drop('Marks',axis=1)

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

**inplace**
- when we do the operation the result output is not overwriting
- means the original dataframe is same as it is
- in order to do this we need to use inplace 
- by default inplace=False
- make **inplace=True** if you want overwrite the reult

In [43]:
d={'Names':['Ramesh','Suresh','Sathish'],
   'Age':[20,22,24],
   'City':['Hyd','Pune','Blr'],
  'Marks':[34,56,54]}
df=pd.DataFrame(d)
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd     34
1   Suresh   22  Pune     56
2  Sathish   24   Blr     54

In [32]:
df.drop('Marks',axis=1,inplace=True)
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

**step-14: Rename the column**

In [33]:
d={'City':'city'} #{old:new}
# df.rename(<mapper><axis>,<inplace>
df.rename(d,axis=1,inplace=True)

In [34]:
d={2:'B'} #{old:new}
# df.rename(<mapper><axis>,<inplace>
df.rename(d,axis=0,inplace=True)

In [35]:
df

     Names  Age  city
0   Ramesh   20   Hyd
1   Suresh   22  Pune
B  Sathish   24   Blr

In [36]:
#create one more df
# x = 1 to 10
#y=square x
#z= cube x
x=list(range(1,11))
y=[i*i for i in x]
z=[i**3 for i in x]
df=pd.DataFrame(zip(x,y,z),
   columns=['X','Y','Z'])
df

    X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

- len
- shape
- size
- head
- tail
- is null
- info
- dtypes

In [37]:
len(df)

10

In [38]:
df.shape

(10, 3)

In [39]:
df.size

30

In [41]:
df.head()

   X   Y    Z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125

In [42]:
df.tail()

    X    Y     Z
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [44]:
df.isnull()

       X      Y      Z
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False
7  False  False  False
8  False  False  False
9  False  False  False

In [45]:
df.isnull().sum()

X    0
Y    0
Z    0
dtype: int64

In [46]:
df.dtypes
#if any columns occurs
#it

X    int64
Y    int64
Z    int64
dtype: object

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       10 non-null     int64
 1   Y       10 non-null     int64
 2   Z       10 non-null     int64
dtypes: int64(3)
memory usage: 372.0 bytes

**step-15: Select a columns**

In [81]:
df.columns

Index(['X', 'Y', 'Z'], dtype='object')

In [82]:
df['X']

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: X, dtype: int64

In [83]:
df[['X','Y']]

    X    Y
0   1    1
1   2    4
2   3    9
3   4   16
4   5   25
5   6   36
6   7   49
7   8   64
8   9   81
9  10  100

In [48]:
type(df['X'])
# 1D

pandas.core.series.Series

In [49]:
type(df[['X','Y']])
# 2D

pandas.core.frame.DataFrame

In [50]:
df['X'].shape

(10,)

In [51]:
df[['X','Y']].shape

(10, 2)

In [52]:
df # dataframe
df['Z'] # selectiong one particular column
df['Z'].values #extractiong the data
df['Z'].values.tolist()

[1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]

In [53]:
df
df['X']
df['X'].values
df['X'].values.tolist()

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [55]:
df
df[['Y','Z']]
df[['Y','Z']].values
df[['Y','Z']].values.tolist()

[[1, 1],
 [4, 8],
 [9, 27],
 [16, 64],
 [25, 125],
 [36, 216],
 [49, 343],
 [64, 512],
 [81, 729],
 [100, 1000]]